#+STARTUP: my-gtd
#+STARTUP: hidestarts

* Workspace
** TODO [#A] English twenty words a day                        :home:@learn:
   SCHEDULED: <2017-08-09 Wed 21:00 ++1d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-09 Wed 16:30]
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-08-09 Wed 16:30]
   CLOCK: [2017-08-09 三 16:08]--[2017-08-09 Wed 16:30] =>  0:22
   - State "STARTED"    from "WAITING"    [2017-08-09 三 16:08]
   CLOCK: [2017-08-09 三 16:08]--[2017-08-09 Wed 16:29] =>  0:21
   - State "WAITING"    from "STARTED"    [2017-08-09 三 11:34] \\
     午饭
   CLOCK: [2017-08-09 Wed 11:23]--[2017-08-09 三 11:34] =>  0:11
   - State "DONE"       from "STARTED"    [2017-07-16 日 22:55]
   - State "DONE"       from "TODO"       [2017-06-14 三 22:50]
   - State "DONE"       from "STARTED"    [2017-06-14 三 22:47]
   CLOCK: [2017-06-14 Wed 22:07]--[2017-06-14 三 22:47] =>  0:40
   - State "TODO"       from "DONE"       [2017-06-13 Tue 22:54]
   - State "DONE"       from "STARTED"    [2017-06-13 二 22:47]
   - State "DONE"       from "TODO"       [2017-06-03 Sat 14:58]
   - State "DONE"       from "TODO"       [2017-06-02 Sat 00:54]
   - State "DONE"       from "TODO"       [2017-06-01 周四 16:57]
   - State "DONE"       from "STARTED"    [2017-05-30 Tue 17:19]
   - State "DONE"       from "TODO"       [2017-05-29 Mon 09:53]
   - State "DONE"       from "TODO"       [2017-05-27 Sat 23:23]
   - State "DONE"       from "TODO"       [2017-05-26 周五 11:22]
   :END:
   [[file:~/org-notes/the-english-word-learing.org::*The English Word Learing][英文单词学习]]

** TODO [#A] Technical Article Reading                         :home:@learn:
   DEADLINE: <2017-08-09 Wed 22:00 ++1d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-08-09 Wed 16:57]
   :Effort:   00:30
   :ORDERED:  t
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-08-09 Wed 16:57]
   CLOCK: [2017-08-09 Wed 16:38]--[2017-08-09 Wed 16:57] =>  0:19
   - State "DONE"       from "STARTED"    [2017-07-21 五 16:03]
   CLOCK: [2017-07-21 五 15:19]--[2017-07-24 一 09:30] => 66:11
   - State "DONE"       from "STARTED"    [2017-07-19 三 16:06]
   CLOCK: [2017-07-19 三 15:36]--[2017-07-19 三 16:06] =>  0:30
   - State "DONE"       from "STARTED"    [2017-07-18 Tue 23:43]
   CLOCK: [2017-07-18 Tue 23:03]--[2017-07-18 Tue 23:43] =>  0:40
   - State "DONE"       from "STARTED"    [2017-07-17 Mon 23:05]
   - State "DONE"       from "STARTED"    [2017-06-22 Thu 22:27]
   CLOCK: [2017-06-22 Thu 21:39]--[2017-06-22 Thu 22:27] =>  0:48
   - State "DONE"       from "STARTED"    [2017-06-21 Wed 23:30]
   - State "STARTED"    from "WAITING"    [2017-06-21 Wed 22:57]
   CLOCK: [2017-06-21 Wed 22:57]--[2017-06-21 Wed 23:30] =>  0:33
   - State "WAITING"    from "STARTED"    [2017-06-21 Wed 22:27] \\
     洗澡休息
   CLOCK: [2017-06-21 Wed 22:00]--[2017-06-21 Wed 22:27] =>  0:27
   - State "DONE"       from "STARTED"    [2017-06-21 Wed 00:01]
   CLOCK: [2017-06-20 Tue 22:31]--[2017-06-21 Wed 00:01] =>  1:30
   - State "DONE"       from "TODO"       [2017-06-19 Mon 22:33]
   - State "DONE"       from "STARTED"    [2017-06-18 Sun 21:59]
   CLOCK: [2017-06-18 Sun 21:20]--[2017-06-18 Sun 21:59] =>  0:39
   - State "DONE"       from "TODO"       [2017-06-14 三 22:52]
   - State "DONE"       from "TODO"       [2017-06-14 三 22:50]
   - State "DONE"       from "STARTED"    [2017-06-03 Sat 15:43]
     CLOCK: [2017-06-03 Sat 15:15]--[2017-06-03 Sat 15:40] =>  0:25
     - State "STARTED"    from "WAITING"    [2017-06-03 Sat 15:15]
     - State "WAITING"    from "STARTED"    [2017-06-03 Sat 15:06]
     - State "DONE"       from "STARTED"    [2017-06-01 周四 17:29]
       CLOCK: [2017-06-01 周四 17:11]--[2017-06-01 周四 17:29] =>  0:18
       - State "DONE"       from "STARTED"    [2017-05-31 周三 17:59]
       CLOCK: [2017-05-31 周三 17:22]--[2017-05-31 周三 17:47] =>  0:25
       - State "DONE"       from "TODO"       [2017-05-30 Tue 21:30]
       - State "DONE"       from "STARTED"    [2017-05-30 二 15:18]
       - State "DONE"       from "TODO"       [2017-05-29 Mon 23:16]
       - State "DONE"       from "TODO"       [2017-05-29 Mon 09:53]
       - State "DONE"       from "TODO"       [2017-05-27 Sat 23:21]
       - State "DONE"       from "TODO"       [2017-05-26 周五 11:23]
   :END:
   [[file:~/org-notes/the-english-word-learing.org::*Read Articles Every Day][技术文章学习]]

** DONE [#B] Portal紧急需求转测、针对Bug做相应修改                    :@work:
   CLOSED: [2017-05-26 周五 11:26] DEADLINE: <2017-05-26 周五26 周五 13:40>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-26 周五 13:57]
     CLOCK: [2017-05-26 周五 13:40]--[2017-05-26 周五 13:57] =>  0:17
   :END:

** DONE [#B] 节日前上线Bug整改                                       :@work:
   CLOSED: [2017-05-31 周三 10:54] SCHEDULED: <2017-05-31 周三 10:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-31 周三 10:54]
     CLOCK: [2017-05-31 周三 10:41]--[2017-05-31 周三 10:54] =>  0:13
   :END:

** DONE [#B] 学习使用Intellij 搭建Java                              :@learn:
   CLOSED: [2017-05-31 周三 14:55] SCHEDULED: <2017-05-31 周三 13:30>
   :PROPERTIES:
   :Effort:   01:00
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-31 周三 14:55]
     CLOCK: [2017-05-31 周三 14:42]--[2017-05-31 周三 14:55] =>  0:13
     CLOCK: [2017-05-31 周三 14:07]--[2017-05-31 周三 14:32] =>  0:25
   :END:

** DONE [#B] 场景化商品调整后不展示                                  :@temp:
   CLOSED: [2017-05-31 周三 17:21] SCHEDULED: <2017-05-31 周三 14:30>
   :PROPERTIES:
   :Effort:   01:00
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-05-31 周三 17:21]
     CLOCK: [2017-05-31 周三 16:42]--[2017-05-31 周三 17:07] =>  0:25
     CLOCK: [2017-05-31 周三 16:12]--[2017-05-31 周三 16:37] =>  0:25
   :END:

** DONE [#B] Portal验证码开关(便于自动化测试使用)                    :@work:


   CLOSED: [2017-06-01 周四 11:38] SCHEDULED: <2017-06-01 周四 10:00>
   :PROPERTIES:
   :Effort:   02:00
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-01 周四 11:38]
   :END:

** DONE [#B] 将登陆页面验证码去掉                                    :@temp:
   CLOSED: [2017-06-01 周四 16:19] SCHEDULED: <2017-06-01 周四 16:00>
   :PROPERTIES:
   :Effort:   00:20
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-01 周四 16:19]
   :END:

** DONE [#B] Portal场景化产品及呈现更改 [100%]                       :@work:
   CLOSED: [2017-06-02 周五 10:29] SCHEDULED: <2017-06-02 周五 09:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-02 周五 10:29]
     CLOCK: [2017-06-02 周五 10:07]--[2017-06-02 周五 10:29] =>  0:22
     CLOCK: [2017-06-02 周五 09:32]--[2017-06-02 周五 09:57] =>  0:25
   :END:
   - [X] 企业招聘商品整合为初级版、中级版、高级版.
   - [X] Portal呈现修改为初级版、中级版、高级版.
   - [X] 产品样例修改(招聘类).
   - [X] 包含内容显示修改(查询商品之前呈现).
   - [X] 查询条件及呈现内容修改.

** DONE [#B] Google Canlander Combination                            :@learn:
   CLOSED: [2017-06-02 周五 17:22] SCHEDULED: <2017-06-02 周五 13:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-02 周五 17:22]
   :END:
   1. 已完成.
   2. 与calfw结合尚未成功.

** DONE [#A] Portal预付费及后付费功能调整 [100%]              :office:@work:
   CLOSED: [2017-06-14 三 22:51] SCHEDULED: <2017-06-05 周一 10:00>--<2017-06-09 周五 18:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-14 三 22:51]
   - State "DONE"       from "WAITING"    [2017-06-13 Tue 22:52]
   CLOCK: [2017-06-12 周一 14:09]--[2017-06-12 周一 16:27] =>  2:18
   CLOCK: [2017-06-12 周一 10:07]--[2017-06-12 周一 11:48] =>  1:41
   - State "STARTED"    from "WAITING"    [2017-06-12 周一 10:07]
   - State "WAITING"    from "STARTED"    [2017-06-09 周五 14:22] \\
     临时有事暂停.
     CLOCK: [2017-06-09 周五 14:16]--[2017-06-09 周五 14:23] =>  0:07
     CLOCK: [2017-06-09 周五 11:39]--[2017-06-09 周五 11:54] =>  0:15
     CLOCK: [2017-06-09 周五 10:43]--[2017-06-09 周五 11:03] =>  0:20
     CLOCK: [2017-06-09 周五 09:56]--[2017-06-09 周五 10:21] =>  0:25
     CLOCK: [2017-06-09 周五 09:24]--[2017-06-09 周五 09:49] =>  0:25
     CLOCK: [2017-06-08 周四 15:40]--[2017-06-08 周四 16:01] =>  0:21
     CLOCK: [2017-06-08 周四 14:58]--[2017-06-08 周四 15:23] =>  0:25
     CLOCK: [2017-06-08 周四 13:37]--[2017-06-08 周四 14:02] =>  0:25
     CLOCK: [2017-06-08 周四 10:07]--[2017-06-08 周四 10:32] =>  0:25
     CLOCK: [2017-06-06 周二 16:13]--[2017-06-06 周二 16:38] =>  0:25
     CLOCK: [2017-06-06 周二 14:45]--[2017-06-06 周二 15:10] =>  0:25
     CLOCK: [2017-06-06 周二 14:12]--[2017-06-06 周二 14:37] =>  0:25
     CLOCK: [2017-06-06 周二 13:52]--[2017-06-06 周二 14:03] =>  0:11
     CLOCK: [2017-06-06 周二 10:47]--[2017-06-06 周二 11:12] =>  0:25
     CLOCK: [2017-06-06 周二 10:14]--[2017-06-06 周二 10:39] =>  0:25
     CLOCK: [2017-06-05 周一 14:55]--[2017-06-05 周一 15:20] =>  0:25
     CLOCK: [2017-06-05 周一 14:15]--[2017-06-05 周一 14:40] =>  0:25
     CLOCK: [2017-06-05 周一 13:42]--[2017-06-05 周一 14:07] =>  0:25
     CLOCK: [2017-06-05 周一 11:36]--[2017-06-05 周一 11:55] =>  0:19
     - State "STARTED"    from "WAITING"    [2017-06-05 周一 11:36]
     - State "WAITING"    from "STARTED"    [2017-06-05 周一 11:21] \\
       临时有事 耽误一下
       CLOCK: [2017-06-05 周一 11:02]--[2017-06-06 周一 11:20] =>  0:18
       CLOCK: [2017-06-05 周一 10:37]--[2017-06-05 周一 11:02] =>  0:25
       CLOCK: [2017-06-05 周一 10:04]--[2017-06-05 周一 10:29] =>  0:25
   :END:
   - [X] 创建赠送次数相关表.
   - [X] 运营管理->用户管理：用户信息列表添加`商品配置`按钮.
   - [X] 运营管理->用户管理：账户信息中添加`付费方式`下拉框.
   - [X] 运营管理->用户管理：用户信息中添加`赠送时间段`.
   - [X] 运营管理->用户管理：用户信息下取消商品配置功能.
   - [X] 运营管理->添加`赠送次数统计`菜单.
   - [X] 运营管理->用户管理：商品配置添加`赠送次数`输入框.
   - [X] 保存商品配置同时保存赠送次数相关信息.
   - [X] 赠送统计列表筛选功能：用户账户、接口名称、月份、用户付费方式.
   - [X] 商品配置输入框上提示`赠送次数、价格`.
   - [X] 赠送次数不足总次数10%或小于0时公告提示.
   - [X] 每次查询免费次数-1, 小于0或则不再进行提示.
   - [X] 赠送次数列表：不显示普通用户信息.
   - [X] 每月1日凌晨重置免费赠送次数.
   - [ ] 赠送结束后的处理.
   - [ ] 计费处理.

** CANCELLED [#C] 意高系统架构                                :office:@free:
   CLOSED: [2017-06-06 周二 09:04] SCHEDULED: <2017-06-05 周一 10:00>
   :LOGBOOK:
   - State "CANCELLED"  from "SOMEDAY"    [2017-06-06 周二 09:04] \\
     有其他事,暂时搁置.
   - State "SOMEDAY"    from "WAITING"    [2017-06-06 周二 09:01]
   :END:

** DONE [#A] Portal场景化功能转测                             :office:@work:
   CLOSED: [2017-06-06 周二 13:51] SCHEDULED: <2017-06-06 周二 09:40>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-06 周二 13:51]
     CLOCK: [2017-06-06 周二 09:53]--[2017-06-06 周二 10:13] =>  0:20
   :END:

** DONE [#B] Learn emacs `bing-dict` plugin                   :office:@learn:
   CLOSED: [2017-06-06 周二 15:51] SCHEDULED: <2017-06-06 周二 15:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-06 周二 15:51]
     CLOCK: [2017-06-06 周二 15:29]--[2017-06-06 周二 15:51] =>  0:22
   :END:
** DONE [#B] 保利国际看电影：新木乃伊                            :home@paly:
   CLOSED: [2017-06-09 Fri 23:51] SCHEDULED: <2017-06-09 Fri 20:40>
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-06-09 Fri 23:51]
   :END:

** DONE [#A] Hack MacOS                                          :home@hack:
   CLOSED: [2017-06-15 Thu 23:49] SCHEDULED: <2017-06-10 Sat 09:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-15 Thu 23:49]
   - State "STARTED"    from "DONE"       [2017-06-15 Thu 22:21]
   CLOCK: [2017-06-15 Thu 22:21]--[2017-06-15 Thu 23:49] =>  1:28
   - State "DONE"       from "STARTED"    [2017-06-14 Thu 24:00]
   - State "STARTED"    from "DONE"       [2017-06-14 三 22:55]
   :END:

** DONE [#B] Study At Starbucks                             :outside:@learn:
   CLOSED: [2017-06-10 六 17:34] SCHEDULED: <2017-06-10 六 15:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-10 六 17:34]
     CLOCK: [2017-06-10 六 16:07]--[2017-06-10 六 17:34] =>  1:27
   :END:
   - 在复城国际星巴克学习org-mode整理

** DONE [#B] 跑步锻炼                                       :outside:@habit:
   CLOSED: [2017-06-15 Thu 22:00] SCHEDULED: <2017-06-15 Thu 21:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-15 Thu 22:00]
   CLOCK: [2017-06-15 Thu 21:08]--[2017-06-15 Thu 22:00] =>  0:52
   :END:

** DONE [#B] Config better the idea tools                        :home@hack:
   CLOSED: [2017-06-17 Sat 01:26] SCHEDULED: <2017-06-17 Sat 00:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-17 Sat 01:26]
   CLOCK: [2017-06-17 Sat 00:33]--[2017-06-17 Sat 01:26] =>  0:53
   :END:

** DONE [#B] StarBucks Learn                                 :outside@learn:
   CLOSED: [2017-06-17 Sat 17:40] SCHEDULED: <2017-06-17 Sat 16:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-17 Sat 17:40]
   CLOCK: [2017-06-17 Sat 16:13]--[2017-06-17 Sat 17:40] =>  1:27
   :END:
   1. Learn use intellij idea hot development
   2. Learn ubersicht install calendar plugin (not fund my fit the plugin)
   3. Learn popclip plugins using

** DONE [#B] Learn Java8 New Features [4/4]                     :home@learn:
   CLOSED: [2017-06-18 Sun 17:07] SCHEDULED: <2017-06-17 Sat 23:50>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-18 Sun 17:07]
   CLOCK: [2017-06-18 Sun 15:45]--[2017-06-18 Sun 17:07] =>  1:22
   CLOCK: [2017-06-17 Sat 23:55]--[2017-06-18 Sun 00:20] => 00:25
   :END:
   - [X] Function Interface
   - [X] Lambda Expression
   - [X] Method Quote
   - [X] Composite Lambda

** DONE [#B] Learn Java Content                                 :home@learn:
   CLOSED: [2017-06-19 Mon 22:34] SCHEDULED: <2017-06-19 Mon 20:40>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-19 Mon 22:34]
   CLOCK: [2017-06-19 Mon 20:40]--[2017-06-19 Mon 22:34] =>  1:54
   :END:

** DONE [#B] Web Learn                                          :home@learn:
   CLOSED: [2017-06-24 Sat 15:17] SCHEDULED: <2017-06-21 Wed 21:40>
   :LOGBOOK:
   - State "DONE"       from "WAITING"    [2017-06-24 Sat 15:17]
   - State "WAITING"    from "STARTED"    [2017-06-21 Wed 22:00] \\
     临时学习其他内容
   CLOCK: [2017-06-21 Wed 21:45]--[2017-06-21 Wed 22:00] =>  0:15
   :END:

** DONE [#B] StarBucks Learn                                 :outside@learn:
   CLOSED: [2017-06-24 Sat 17:10] SCHEDULED: <2017-06-24 Sat 15:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-06-24 Sat 17:10]
   CLOCK: [2017-06-24 Sat 15:17]--[2017-06-24 Sat 17:10] =>  1:53
   :END:

** DONE [#B] Portal Bug Modify [3/3]                          :office:@work:
   CLOSED: [2017-07-17 一 16:15] SCHEDULED: <2017-07-17 一 10:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-17 一 16:15]
   :END:
   - [X] 学历信息:　单一查询中有,组合查询中没有.
   - [X] 运营商计费: 将全部手机号判断运营商改为 -> 优分:　手机号三要素、手机在网时长、手机在网状态.
   - [X] 历史报告: 法院判决详情历史查看功能支持.

** DONE [#B] Api Bug Modify                                   :office:@wrok:
   CLOSED: [2017-07-17 一 16:18] SCHEDULED: <2017-07-17 一 13:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-17 一 16:18]
   :END:
   - [X] 接口名称显示: 统一接口名称显示问题(显示准确接口名).
   - [X] 运营商计费: 将全部手机号判断运营商改为 -> 优分: 手机号三要素、手机在网时长、手机在网状态.

** DONE [#B] Api 备选接口不可用                               :office:@temp:
   CLOSED: [2017-07-17 一 17:01] SCHEDULED: <2017-07-17 一 16:28>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-17 一 17:01]
   CLOCK: [2017-07-17 一 16:29]--[2017-07-17 一 16:54] =>  0:25
   :END:
   - [X] Api 备选接口配置中不呈现,点击备选接口配置出现异常.

** DONE [#B] Portal 姓名、身份证 不呈现                       :office:@temp:
   CLOSED: [2017-07-17 一 18:14] SCHEDULED: <2017-07-17 一 17:15>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-17 一 18:14]
   CLOCK: [2017-07-17 一 17:18]--[2017-07-17 一 18:14] =>  0:56
   :END:
   - [X] Portal 姓名、身份证商品没有呈现出来.

** DONE [#A] 09:10 早会                                       :office:@work:
   CLOSED: [2017-08-08 Tue 14:35]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-08-08 Tue 14:35]
   CLOCK: [2017-07-25 二 09:12]--[2017-07-25 二 09:16] =>  0:04
   CLOCK: [2017-07-21 五 09:17]--[2017-07-21 五 09:31] =>  0:14
   CLOCK: [2017-07-20 四 09:12]--[2017-07-20 四 09:18] =>  0:06
   CLOCK: [2017-07-19 三 09:11]--[2017-07-19 三 09:18] =>  0:07
   :END:
   <%%(and (= 2 (calendar-day-of-week date))(diary-block 7 17 2017 7 30 2017))>
   <%%(and (= 3 (calendar-day-of-week date))(diary-block 7 17 2017 7 30 2017))>
   <%%(and (= 4 (calendar-day-of-week date))(diary-block 7 17 2017 7 30 2017))>
   <%%(and (= 5 (calendar-day-of-week date))(diary-block 7 17 2017 7 30 2017))>

** DONE [#B] 学习org-mode复杂日期实现                         :office@learn:
   CLOSED: [2017-07-18 二 14:30] SCHEDULED: <2017-07-18 二 10:50>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-18 二 14:30]
   CLOCK: [2017-07-18 二 10:45]--[2017-07-18 二 11:37] =>  0:52
   :END:
   http://www.gnu.org/software/emacs/manual/html_node/emacs/Sexp-Diary-Entries.html#Sexp-Diary-Entries
   http://orgmode.org/org.html#Timestamps

** CANCELLED [#B] Portal 全选呈现问题                         :office:@temp:
   CLOSED: [2017-07-18 二 18:13] SCHEDULED: <2017-07-18 二 16:10>
   :LOGBOOK:
   - State "CANCELLED"  from "WAITING"    [2017-07-18 二 18:13] \\
     不知道什么问题.
   - State "WAITING"    from "STARTED"    [2017-07-18 二 16:36] \\
     未解决
   CLOCK: [2017-07-18 二 16:11]--[2017-07-18 二 16:36] =>  0:25
   :END:
   - [ ] 全选呈现一直不断刷新网页: net::ERR_INCOMPLETE_CHUNKED_ENCODING

** TODO [#B] 去黄龙溪游玩.


* Once a month
** DONE [#B] Give back credit card
   CLOSED: [2017-07-25 二 10:07] DEADLINE: <2017-07-25 Tue 12:00 -3d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-06-25 Sun 21:50]
   :END:
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-07-25 二 10:07]
   - State "DONE"       from "TODO"       [2017-06-25 Sun 21:50]
   :END:

* Every Week
** TODO [#A] Writing Blog(sum up experience)                     :home@blog:
   DEADLINE: <2017-08-12 Sat 23:00 ++1w -1d>
   :PROPERTIES:
   :LAST_REPEAT: [2017-07-25 二 10:07]
   :END:
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-25 二 10:07]
   CLOCK: [2017-07-25 二 09:34]--[2017-07-25 二 10:07] =>  0:33
   CLOCK: [2017-07-25 二 09:23]--[2017-07-25 二 09:26] =>  0:03
   - State "DONE"       from "STARTED"    [2017-06-17 Sat 21:16]
   CLOCK: [2017-06-17 Sat 19:55]--[2017-06-17 Sat 21:16] =>  1:21
   :END:
   1. 根据一周学习经验总结一次.
   2. 通过1个小时写一篇Blog.
   3. 最好可以使用English.

   |----------+------------------------------------------+--------+------------------|
   | Sequence | Name                                     | Type   | Date             |
   |----------+------------------------------------------+--------+------------------|
   |        1 | [[file:~/blog/source/_posts/My Mac Alfred Workflows.org][My Mac Alfred Workflows]]                  | Tools  | <2017-07-25 Tue> |
   |        2 | [[file:~/blog/source/_posts/Intellij Idea Plugin By Java Development.org][Intellij Idea Plugin By Java Development]] | Plugin | <2017-06-17 Sat> |
   |        3 | [[file:~/blog/source/_posts/Git-Branch-Command.org][Git-Branch-Command]]                       | Git    | <2017-06-03 Sat> |
   |        4 | [[file:~/blog/source/_posts/Git-Command.org][Git-Command]]                              | Git    | <2017-06-01 Thu> |
   #+TBLFM: @3$1..@>$1=@-1+1::@2$1=1

* Project Development
** DONE [#B] 构建Kotlin And Spring Boot项目 [40%]            :home:@project:
   CLOSED: [2017-06-07 Wed 22:24] DEADLINE: <2017-06-07 Wed 23:00>
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2017-06-07 Wed 22:24]
   :END:
   - [X] 构建Kotlin基础框架
   - [X] project environment：Intellij、Spring Boot、Mysql、Maven、Web.
   - [ ] create base database and table.
   - [ ] project framework prototype drawing(Using Mindnode)
   - [ ] project targer confirm

* Kanban
  | TODO                           | STARTED | DONE                                  |
  |--------------------------------+---------+---------------------------------------|
  | [[/Users/wangliang/org-notes/gtd.org::English twenty words a day][English twenty words a day]]     |         | [[/Users/wangliang/org-notes/gtd.org::Portal紧急需求转测、针对Bug做相应修改][Portal紧急需求转测、针对Bug做相应修改]] |
  | [[/Users/wangliang/org-notes/gtd.org::Technical Article Reading][Technical Article Reading]]      |         | [[/Users/wangliang/org-notes/gtd.org::节日前上线Bug整改][节日前上线Bug整改]]                     |
  | [[/Users/wangliang/org-notes/gtd.org::Give back credit card][Give back credit card]]          |         | [[/Users/wangliang/org-notes/gtd.org::学习使用Intellij 搭建Java][学习使用Intellij 搭建Java]]             |
  | [[/Users/wangliang/org-notes/gtd.org::Writing Blog(sum up experience)][Writing Blog(sum up experience]] |         | [[/Users/wangliang/org-notes/gtd.org::场景化商品调整后不展示][场景化商品调整后不展示]]                |
  | [[/Users/wangliang/org-notes/notes.org::Macos 破解软件下载][Macos 破解软件下载]]             |         | [[/Users/wangliang/org-notes/gtd.org::Portal验证码开关(便于自动化测试使用)][Portal验证码开关(便于自动化测试使用)]]  |
  | [[/Users/wangliang/org-notes/notes.org::Mac 常用插件][Mac 常用插件]]                   |         | [[/Users/wangliang/org-notes/gtd.org::将登陆页面验证码去掉][将登陆页面验证码去掉]]                  |
  |                                |         | [[/Users/wangliang/org-notes/gtd.org::/\*.*ortal场景化产品及呈现更改 .100%./][Portal场景化产品及呈现更改 {100%}]]     |
  |                                |         | [[/Users/wangliang/org-notes/gtd.org::Google Canlander Combination][Google Canlander Combination]]          |
  |                                |         | [[/Users/wangliang/org-notes/gtd.org::/\*.*ortal预付费及后付费功能调整 .100%./][Portal预付费及后付费功能调整 {100%}]]   |
  |                                |         | [[/Users/wangliang/org-notes/gtd.org::Portal场景化功能转测][Portal场景化功能转测]]                  |
  #+TBLFM: @1='(kanban-headers $#)::@2$1..@>$>='(kanban-zero @# $#)

  #+BEGIN: columnview :hlines 1 :id global
  | ITEM                                  | TODO      | PRIORITY | TAGS             |
  |---------------------------------------+-----------+----------+------------------|
  | Workspace                             |           | B        |                  |
  | English twenty words a day            | SOMEDAY   | B        | :home:@learn:    |
  | Technical Article Reading             | SOMEDAY   | A        | :home:@learn:    |
  | Portal紧急需求转测、针对Bug做相应修改 | DONE      | B        | :@work:          |
  | 节日前上线Bug整改                     | DONE      | B        | :@work:          |
  | 学习使用Intellij 搭建Java             | DONE      | B        | :@learn:         |
  | 场景化商品调整后不展示                | DONE      | B        | :@temp:          |
  | Portal验证码开关(便于自动化测试使用)  | DONE      | B        | :@work:          |
  | 将登陆页面验证码去掉                  | DONE      | B        | :@temp:          |
  | Portal场景化产品及呈现更改            | DONE      | B        | :@work:          |
  | Google Canlander Combination          | DONE      | B        | :@learn:         |
  | Portal预付费及后付费功能调整          | DONE      | A        | :office:@work:   |
  | 意高系统架构                          | CANCELLED | C        | :office:@free:   |
  | Portal场景化功能转测                  | DONE      | A        | :office:@work:   |
  | Learn emacs `bing-dict` plugin        | DONE      | B        | :office:@learn:  |
  | 保利国际看电影：新木乃伊              | DONE      | B        | :home@paly:      |
  | Hack MacOS                            | DONE      | A        | :home@hack:      |
  | Study At Starbucks                    | DONE      | B        | :outside:@learn: |
  | 跑步锻炼                              | DONE      | B        | :outside:@habit: |
  | Config better the idea tools          | DONE      | B        | :home@hack:      |
  | StarBucks Learn                       | DONE      | B        | :outside@learn:  |
  | Learn Java8 New Features              | DONE      | B        | :home@learn:     |
  | Learn Java Content                    | DONE      | B        | :home@learn:     |
  | Web Learn                             | DONE      | B        | :home@learn:     |
  | StarBucks Learn                       | DONE      | B        | :outside@learn:  |
  | Portal Bug Modify                     | DONE      | B        | :office:@work:   |
  | Api Bug Modify                        | DONE      | B        | :office:@wrok:   |
  | Api 备选接口不可用                    | DONE      | B        | :office:@temp:   |
  | Portal 姓名、身份证 不呈现            | DONE      | B        | :office:@temp:   |
  | 09:10 早会                            | TODO      | A        | :office:@work:   |
  | 学习org-mode复杂日期实现              | DONE      | B        | :office@learn:   |
  | Portal 全选呈现问题                   | CANCELLED | B        | :office:@temp:   |
  | 去黄龙溪游玩.                         | TODO      | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Once a month                          |           | B        |                  |
  | Give back credit card                 | DONE      | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Every Week                            |           | B        |                  |
  | Writing Blog(sum up experience)       | TODO      | A        | :home@blog:      |
  |---------------------------------------+-----------+----------+------------------|
  | Project Development                   |           | B        |                  |
  | 构建Kotlin And Spring Boot项目        | DONE      | B        | :home:@project:  |
  |---------------------------------------+-----------+----------+------------------|
  | Emergency Requirements                |           | B        |                  |
  | Portal场景化余额提醒Bug修改           | DONE      | A        | :office:@work:   |
  |---------------------------------------+-----------+----------+------------------|
  | Kanban                                |           | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Last Week                             |           | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Weekly Work Statistics                |           | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Monthly Work Statistics               |           | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Annual Every Year                     |           | B        |                  |
  |---------------------------------------+-----------+----------+------------------|
  | Eagle                                 |           | B        |                  |
  | Portal 运营商商品呈现问题             | DONE      | A        |                  |
  | Portal 接入微众税银                   | DONE      | A        | :office:@work:   |
  | Portal 微众税银                       | DONE      | A        | :office:@work:   |
  | Portal 微众税银展示                   | DONE      | A        | :office:@work:   |
  | Portal 法院判决Bug                    | DONE      | A        | :office:@work:   |
  | 简报考试                              | DONE      | A        | :office:@work:   |
  | 日常工作 2017年 07月 24日 星期一      | DONE      | A        | :office:@work:   |
  #+END:
* Last Week
  #+BEGIN: clocktable :maxlevel 2 :scope agenda-with-archives :block lastweek :fileskip0 t :indent t
  #+CAPTION: Clock summary at [2017-08-06 Sun 22:48], for week 2017-W30.
  | File    | Headline                                   |    Time |      |
  |---------+--------------------------------------------+---------+------|
  |         | ALL *Total time*                           | *15:31* |      |
  |---------+--------------------------------------------+---------+------|
  | gtd.org | *File time*                                | *15:31* |      |
  |         | Workspace                                  |    9:34 |      |
  |         | \_  Technical Article Reading              |         | 9:30 |
  |         | \_  09:10 早会                             |         | 0:04 |
  |         | Every Week                                 |    0:36 |      |
  |         | \_  Writing Blog(sum up experience)        |         | 0:36 |
  |         | Eagle                                      |    5:21 |      |
  |         | \_  简报考试                               |         | 0:11 |
  |         | \_  日常工作 2017年 07月 24日 星期一 [7/7] |         | 5:10 |
  #+END:

* Weekly Work Statistics
  #+BEGIN: clocktable :maxlevel 2 :scope agenda :block thisweek :fileskip0 t :indent t
  #+CAPTION: Clock summary at [2017-08-06 Sun 22:48], for week 2017-W31.
  | File | Headline         | Time   |   |
  |------+------------------+--------+---|
  |      | ALL *Total time* | *0:00* |   |
  #+END:

  #+BEGIN_SRC emacs-lisp :results value
    (setq week-range (org-clock-special-range 'thisweek nil t))
    (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth i week-range) t)
  #+END_SRC

* Monthly Work Statistics
  #+BEGIN: clocktable :maxlevel 2 :scope agenda :block thismonth :fileskip0 t :indent t
  #+CAPTION: Clock summary at [2017-08-06 Sun 22:48], for August 2017.
  | File | Headline         | Time   |   |
  |------+------------------+--------+---|
  |      | ALL *Total time* | *0:00* |   |
  #+END:

  #+BEGIN_SRC emacs-lisp :results value
    (setq week-range (org-clock-special-range 'thisweek nil t))
    (org-clock-sum-today-by-tags nil (nth 0 week-range) (nth i week-range) t)
  #+END_SRC

* Annual Every Year
  #+BEGIN: clocktable :maxlevel 2 :scope agenda :block thisyear :fileskip0 t :indent t
  #+CAPTION: Clock summary at [2017-08-06 Sun 22:48], for the year 2017.
  | File    | Headline                                   | Time       |          |
  |---------+--------------------------------------------+------------+----------|
  |         | ALL *Total time*                           | *5d 21:24* |          |
  |---------+--------------------------------------------+------------+----------|
  | gtd.org | *File time*                                | *5d 21:24* |          |
  |         | Workspace                                  | 5d 7:43    |          |
  |         | \_  English twenty words a day             |            |     0:40 |
  |         | \_  Technical Article Reading              |            |  3d 0:26 |
  |         | \_  Portal紧急需求转测、针对Bug做相应修改  |            |     0:17 |
  |         | \_  节日前上线Bug整改                      |            |     0:13 |
  |         | \_  学习使用Intellij 搭建Java              |            |     0:38 |
  |         | \_  场景化商品调整后不展示                 |            |     0:50 |
  |         | \_  Portal场景化产品及呈现更改 [100%]      |            |     0:47 |
  |         | \_  Portal预付费及后付费功能调整 [100%]    |            | 1d 12:05 |
  |         | \_  Portal场景化功能转测                   |            |     0:20 |
  |         | \_  Learn emacs `bing-dict` plugin         |            |     0:22 |
  |         | \_  Hack MacOS                             |            |     1:28 |
  |         | \_  Study At Starbucks                     |            |     1:27 |
  |         | \_  跑步锻炼                               |            |     0:52 |
  |         | \_  Config better the idea tools           |            |     0:53 |
  |         | \_  StarBucks Learn                        |            |     1:27 |
  |         | \_  Learn Java8 New Features [4/4]         |            |     1:47 |
  |         | \_  Learn Java Content                     |            |     1:54 |
  |         | \_  Web Learn                              |            |     0:15 |
  |         | \_  StarBucks Learn                        |            |     1:53 |
  |         | \_  Api 备选接口不可用                     |            |     0:25 |
  |         | \_  Portal 姓名、身份证 不呈现             |            |     0:56 |
  |         | \_  09:10 早会                             |            |     0:31 |
  |         | \_  学习org-mode复杂日期实现               |            |     0:52 |
  |         | \_  Portal 全选呈现问题                    |            |     0:25 |
  |         | Every Week                                 | 1:57       |          |
  |         | \_  Writing Blog(sum up experience)        |            |     1:57 |
  |         | Emergency Requirements                     | 0:25       |          |
  |         | \_  Portal场景化余额提醒Bug修改            |            |     0:25 |
  |         | Eagle                                      | 11:19      |          |
  |         | \_  Portal 运营商商品呈现问题              |            |     0:25 |
  |         | \_  Portal 接入微众税银 [5/5]              |            |     0:49 |
  |         | \_  Portal 微众税银 [2/2]                  |            |     2:17 |
  |         | \_  Portal 微众税银展示                    |            |     2:04 |
  |         | \_  Portal 法院判决Bug [2/2]               |            |     0:23 |
  |         | \_  简报考试                               |            |     0:11 |
  |         | \_  日常工作 2017年 07月 24日 星期一 [7/7] |            |     5:10 |
  #+END:
* Eagle
** DONE [#A] Portal 运营商商品呈现问题
   CLOSED:[2017-07-18 二 12:04] SCHEDULED: <2017-07-18 二 11:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-18 二 12:04]
   CLOCK: [2017-07-18 二 11:38]--[2017-07-18 二 12:03] =>  0:25
   :END:

** DONE [#A] Portal 接入微众税银 [5/5]                        :office:@work:
   CLOSED: [2017-07-19 三 09:49] SCHEDULED: <2017-07-18 二 15:05>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-19 三 09:49]
   CLOCK: [2017-07-19 三 09:37]--[2017-07-19 三 09:47] =>  0:10
   - State "WAITING"    from "STARTED"    [2017-07-18 二 16:09] \\
     解决Bug
   - State "STARTED"    from "WAITING"    [2017-07-18 二 15:38]
   CLOCK: [2017-07-18 二 15:38]--[2017-07-18 二 16:09] =>  0:31
   - State "WAITING"    from "STARTED"    [2017-07-18 二 15:19] \\
     临时有事, 耽搁一下.
   CLOCK: [2017-07-18 二 15:11]--[2017-07-18 二 15:19] =>  0:08
   :END:
   - [X] 添加ApiSpec
   - [X] 添加Product
   - [X] 添加Goods
   - [X] 添加查询条件: 企业名称、税务识别码.
   - [X] 调取数据回来

** DONE [#A] Portal 微众税银 [2/2]                            :office:@work:
   CLOSED: [2017-07-19 三 14:43] SCHEDULED: <2017-07-19 三 09:40>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-19 三 14:43]
   - State "STARTED"    from "WAITING"    [2017-07-19 三 14:00]
   CLOCK: [2017-07-19 三 14:00]--[2017-07-19 三 14:43] =>  0:43
   - State "WAITING"    from "STARTED"    [2017-07-19 三 11:24] \\
     数据库被修改(作性能测试),导致无法继续开发
   CLOCK: [2017-07-19 三 09:50]--[2017-07-19 三 11:24] =>  1:34
   :END:
   - [X] Portal数据呈现
   - [X] Api端接入数据同步

** DONE [#A] Portal 微众税银展示                              :office:@work:
   CLOSED: [2017-07-20 四 14:10] SCHEDULED: <2017-07-20 四 09:40>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-20 四 14:10]
   - State "STARTED"    from "WAITING"    [2017-07-20 四 13:46]
   CLOCK: [2017-07-20 四 13:46]--[2017-07-20 四 14:10] =>  0:24
   - State "WAITING"    from "STARTED"    [2017-07-20 四 12:55] \\
     午休
   - State "STARTED"    from "WAITING"    [2017-07-20 四 11:20]
   CLOCK: [2017-07-20 四 11:20]--[2017-07-20 四 12:00] =>  0:40
   - State "WAITING"    from "STARTED"    [2017-07-20 四 10:35] \\
     返回数据结构不清晰,等待修改.
   CLOCK: [2017-07-20 四 09:35]--[2017-07-20 四 10:35] =>  1:00
   :END:

** DONE [#A] Portal 法院判决Bug [2/2]                         :office:@work:
   CLOSED: [2017-07-21 五 14:17] SCHEDULED: <2017-07-21 五 11:44>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-21 五 14:17]
   - State "STARTED"    from "WAITING"    [2017-07-21 五 14:13]
   CLOCK: [2017-07-21 五 14:13]--[2017-07-21 五 14:17] =>  0:04
   - State "WAITING"    from "STARTED"    [2017-07-21 五 12:04] \\
     午休吃饭
   CLOCK: [2017-07-21 五 11:45]--[2017-07-21 五 12:04] =>  0:19
   :END:
   - [X] 个人法院判决详情: 文书Id为空时,不展示详情查询链接.
   - [X] 企业法院判决详情: 文书Id为空时,不展示详情查询链接.

** DONE [#A] 简报考试                                         :office:@work:
   CLOSED: [2017-07-24 一 09:41] SCHEDULED: <2017-07-24 一 09:30>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-24 一 09:41]
   CLOCK: [2017-07-24 一 09:30]--[2017-07-24 一 09:41] =>  0:11
   :END:

** DONE [#A] 日常工作 2017年 07月 24日 星期一 [7/7]           :office:@work:
   CLOSED: [2017-07-26 三 17:21] DEADLINE: <2017-07-28 一 18:00>
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2017-07-26 三 17:21]
   - State "STARTED"    from "WAITING"    [2017-07-26 三 17:12]
   CLOCK: [2017-07-26 三 17:12]--[2017-07-26 三 17:21] =>  0:09
   - State "WAITING"    from "STARTED"    [2017-07-26 三 16:48] \\
     其他任务
   - State "STARTED"    from "WAITING"    [2017-07-26 三 15:45]
   CLOCK: [2017-07-26 三 15:45]--[2017-07-26 三 16:48] =>  1:03
   - State "WAITING"    from "STARTED"    [2017-07-25 二 11:08] \\
     其他事
   - State "STARTED"    from "WAITING"    [2017-07-25 二 10:30]
   CLOCK: [2017-07-25 二 10:30]--[2017-07-25 二 11:08] =>  0:38
   - State "WAITING"    from "STARTED"    [2017-07-24 一 17:42] \\
     temp
   CLOCK: [2017-07-24 一 16:15]--[2017-07-24 一 17:42] =>  1:27
   - State "STARTED"    from "WAITING"    [2017-07-24 一 16:11]
   CLOCK: [2017-07-24 一 16:11]--[2017-07-24 一 16:15] =>  0:04
   - State "WAITING"    from "STARTED"    [2017-07-24 一 14:18] \\
     radar map view
   - State "STARTED"    from "WAITING"    [2017-07-24 一 14:05]
   CLOCK: [2017-07-24 一 14:05]--[2017-07-24 一 14:17] =>  0:12
   - State "WAITING"    from "STARTED"    [2017-07-24 一 12:04] \\
     午休
   CLOCK: [2017-07-24 一 11:22]--[2017-07-24 一 12:04] =>  0:42
   CLOCK: [2017-07-24 一 10:27]--[2017-07-24 一 11:22] =>  0:55
   :END:
   - [X] Portal信贷商品: 添加姓名、身份证号查询条件.
   - [X] Portal手机号归属地: 添加姓名、身份证号查询条件.
   - [X] Portal雷达图: 按照5个维度分别提供一次性保存功能(保存当前唯独所有指标值).
   - [X] Portal雷达图: 去掉每个指标单独的保存按钮.
   - [X] 将雷达图配置成商品(控制是否呈现).
   - [X] 字段优化: 权重-->权重(%)、值域-->区间值、分数-->分数占比(%).
   - [X] 指标更改: 指标名及指标类型修改.
